app/controllers/sessions_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "robotempire"], ["email", "matt.deboard@gmail.com"], ["created_at", 2017-08-27 00:56:41 UTC], ["updated_at", 2017-08-27 00:56:41 UTC]]
SELECT  "users".* FROM "users" WHERE "users"."name" = $1 AND "users"."email" = $2 LIMIT $3  [["name", "robotempire"], ["email", "matt.deboard@gmail.com"], ["LIMIT", 1]]
INSERT INTO "authorizations" ("user_id", "uid", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["uid", "109809506464120832"], ["created_at", 2017-08-27 22:33:29 UTC], ["updated_at", 2017-08-27 22:33:29 UTC]]
SELECT  "authorizations".* FROM "authorizations" WHERE "authorizations"."provider" = $1 AND "authorizations"."uid" = $2 AND "authorizations"."user_id" = $3 LIMIT $4  [["provider", "discord"], ["uid", "109809506464120832"], ["user_id", 1], ["LIMIT", 1]]
---
  def create
    @current_user = User.find_or_create_by(
      name: auth_hash['info']['name'],
      email: auth_hash['info']['email']
    )

    authorization = Authorization.find_or_create_by(
      provider: auth_hash['provider'],
      uid: auth_hash['uid'],
      user_id: @current_user.id
    )